package homework;

import java.util.Scanner;

//Є N клієнтів, яким компанія-виробник має доставити товар.
// Скільки є можливих маршрутів доставлення товару з урахуванням того, що товар доставлятиме одна машина?
// Використовуючи IntelliJ IDEA, створіть клас Delivery.
// Напишіть програму, яка розраховуватиме та виводитиме на екран кількість можливих варіантів доставлення товару.
// Для розв'язку задачі, використовуйте факторіал N!, що розраховується рекурсією.
// Поясніть, чому не рекомендується використовувати рекурсію для розрахунку факторіала. Вкажіть слабкі місця цього підходу.
public class Delivery {
    public static void main(String[] ags) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введіть кількість клієнтів: ");
        int n = scanner.nextInt();
        System.out.println(factorial(n));
        System.out.println(factorialLoop(n));
    }

    public static int factorial(int n) {
        if (n <= 2) {
            return n;
        }
        return n * factorial(n - 1); //рекурсія
        // В данном случае применение рекурсивной функции оправдано и безопасно.
        // Мы четко обозначили условие выхода из рекурсивного блока, и мы уверены в том, что он достижим:
        // мы вводим целое неотрицательное число, в случае,
        // если число n <= 2 - возвращаем n,
        // если же число больше — умножаем результат на функцию от числа n-1.
    }
    //без рекурсії
    public static double factorialLoop(int n) {
        double result = 1;
        for (int i = 2; i <= n; i++) {
            result *= i;
        }
        return result;
    }
}
